---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsGroups
source: html/9244a87e-c35f-b6df-9e13-8b1246a27f25.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsGroups Property

Show groups of load classifications in the load summary section

## Syntax (C#)
```csharp
public bool SummaryShowsGroups { get; set; }
```